<?php
echo '4 ЗАДАНИЕ';
echo '<br>';
$b = 2;
$arr1 = [];
$min = 101;
$max = -101;
for ($i = 0; $i < $b; $i++){
    $arr1[$i] = mt_rand(-100.,100);
    echo "$arr1[$i]" . ' ';
}
echo '<br>';
for ($i = 0; $i < $b; $i++){
    if ($arr1[$i] < $min){
        if ($arr1[$i] > 0){
            echo 'Отрицательные числа отсутствуют';
        }   
        else{
            $min = $arr1[$i];
        }
    }
}
echo '<br>';
for ($i = 0; $i < $b; $i++){
    if ($arr1[$i] > $max){
    $max = $arr1[$i];
    }
}
echo  $min.' '.'<br>';
echo  $max. '.' ; 

echo '<br>';
echo '<br>';
echo '5 ЗАДАНИЕ ';
echo '<br>';
$arr2 = ['Иванов', 'Петров', 'Сидоров'];
$arr3 = ['Математика', 'Физика', 'Химия', 'Информатика'];
$arr4 = ['5', '4', '4', '3'];
$arr5 = ['4', '5', '3', '2'];
$arr6 = ['5', '3', '4', '3'];
$arr7 = ['5', '5', '4', '5'];
$sum = 0;
$mid = 0;
foreach ($arr4 as $item){
    $sum= $sum + $item;
}
echo $sum;

echo '<br>';

foreach ($arr4 as $item){
    $mid = array_sum($arr4) / count($arr4);
}
echo $mid;

echo '<br>';
echo '<br>';
echo '6 ЗАДАНИЕ ';
echo '<br>';
$arr8 = [
    'Island' => ['Куба', 'Тринидад', 'Ямайка', 'Гаити'],
    'Month' => ['Январь', 'Февраль','Март','Апрель','Май','Июнь','Июль', 'Август','Сентябрь','Октябрь','Ноябрь','Декабрь'],
    'Temperature_Kuba' => ['Январь'=> '+23', 'Февраль'=> '+23,7', 'Март'=> '+24,3','Апрель'=> '+25,9','Май'=> '+26,2','Июнь'=> '+27,4','Июль'=> '+28,1','Август'=> '+27,6','Сентябрь'=> '+27,6','Октябрь'=> '+26,8','Ноябрь'=> '+25,2','Декабрь'=> '+24,1',],
    'Temperature_Trinidad' => ['Январь'=> '+27', 'Февраль'=> '+26', 'Март'=> '+27','Апрель'=> '+26','Май'=> '+24','Июнь'=> '+23','Июль'=> '+23','Август'=> '+24','Сентябрь'=> '+25','Октябрь'=> '+27','Ноябрь'=> '+27','Декабрь'=> '+27',],
    'Temperature_Jamaica' => ['Январь'=> '+26', 'Февраль'=> '+26', 'Март'=> '+27','Апрель'=> '+28','Май'=> '+28','Июнь'=> '+29','Июль'=> '+29','Август'=> '+29','Сентябрь'=> '+29','Октябрь'=> '+28','Ноябрь'=> '+28','Декабрь'=> '+27',],
    'Temperature_Haiti' => ['Январь'=> '+24', 'Февраль'=> '+25', 'Март'=> '+23','Апрель'=> '+26','Май'=> '+25','Июнь'=> '+28','Июль'=> '+22','Август'=> '+24','Сентябрь'=> '+25','Октябрь'=> '+26','Ноябрь'=> '+27','Декабрь'=> '+28',],
];
$MaxTemp = 0;
foreach($arr8 as $key=>$value){
    if($key == "Temperature_Kuba"){ 
        foreach ($value as $new_key=>$item){
            echo $key .  max($value) .'<br>';
         }
    }
}
echo '<br>';
echo '<br>';
echo '7 ЗАДАНИЕ ';
echo '<br>';
$arr9 = [[1,2,3],[4,5,6], [7,8,9], [10,11,12],[13,14,15], ];
echo '<pre>';
print_r ($arr9);




